In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [7]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
#### you can pass a buit in function to pandas to store it
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [14]:
series1=pd.Series([1,2,3,4],['USA','GERMANY','USSR','JAPAN'])

In [15]:
series1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [16]:
series2=pd.Series([1,2,5,4],['USA','GERMANY','ITALY','JAPAN'])

In [17]:
series2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [18]:
series1['USA']

1

In [19]:
series3=pd.Series(data=labels)

In [20]:
series3

0    a
1    b
2    c
dtype: object

In [24]:
series3[0]

'a'

### note pandas and numpy will always convert stuff to float (keep it in mind)

In [23]:
series1+series2
# if it didnt find matches it will return null value for those
# when you performing operations with pandas serries your integer are going to be converted to floats

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

## dataframe

In [25]:
import numpy as np

In [26]:
import pandas as pd

In [27]:
from numpy.random import randn

In [28]:
np.random.seed(101)

In [32]:
df=pd.DataFrame(randn(4,4),['A','B','C','D'],['W','X','Y','Z'])

In [33]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [34]:
df['W']

A    0.681209
B   -1.005187
C   -1.382920
D    0.992573
Name: W, dtype: float64

In [35]:
type(df['W'])

pandas.core.series.Series

In [36]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df[['W','Z']]

          W         Z
A  0.681209  1.939932
B -1.005187 -0.732845
C -1.382920 -2.141212
D  0.992573  1.292765

### CREATE NEW COLUMN

In [70]:
df['new']= df['W']+df['Y']

In [71]:
df

          W         X         Y         Z       new
A  0.681209  1.035125 -0.031160  1.939932  0.650049
B -1.005187 -0.741790  0.187125 -0.732845 -0.818062
C -1.382920  1.482495  0.961458 -2.141212 -0.421462
D  0.992573  1.192241 -1.046780  1.292765 -0.054206

#### remove a column

In [67]:
### axis=1 refers to columns and axis =0 refers to index
### inplace = true it will drop the columns from the original dataframe not just remove from a view of it

In [72]:
df.drop(['new'],axis=1,inplace=True)

In [73]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [74]:
df.drop('A',inplace=True)

In [75]:
df

          W         X         Y         Z
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [76]:
df.shape

(3, 4)

In [78]:
### SELECT ROWS

In [79]:
df

          W         X         Y         Z
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [83]:
df.loc['B']

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: B, dtype: float64

In [84]:
### iloc returns the rows with the help of index no matter the exact index is string or other data types

In [85]:
df.iloc[0]

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: B, dtype: float64

In [86]:
df.loc['B','Y']

0.1871245217641948

In [87]:
df.loc[['B','C'],['X','Z']]

          X         Z
B -0.741790 -0.732845
C  1.482495 -2.141212